bakerstu/msp430-libs/bq769x0/bq769x0.c
/** Protect 3 */
typedef struct
{
    union
    {
        uint8_t byte; ///< full register byte value
        struct
        {
            uint8_t reserved : 4; ///< reserved
            uint8_t ovD      : 2; ///< overvoltage delay
            uint8_t uvD      : 2; ///< undervoltage delay
        };
    };
} BQ769X0_Protect3;

/** CC */
typedef struct
{
    union
    {
        uint16_t word; ///< raw value as read
        int16_t cc; ///< signed data
    };
} BQ769X0_CC;

/** ADC Gain 1 */
typedef struct
{
    union
    {
        uint8_t byte; ///< full register byte value
        struct
        {
            uint8_t reserved1  : 2; ///< reserved
            uint8_t adcgain3_4 : 2; ///< ADC gain bits 3 and 4
            uint8_t reserved2  : 4; ///< undervoltage delay
        };
    };
} BQ769X0_AdcGain1;

/** ADC Gain 2 */
typedef struct
{
    union
    {
        uint8_t byte; ///< full register byte value
        struct
        {
            uint8_t reserved     : 5; ///< reserved
            uint8_t adcgain0_1_2 : 2; ///< ADC gain bits 0, 1, and 2
        };
    };
} BQ769X0_AdcGain2;

/** total nAH */
/*static*/ int64_t nAH = 0;

/** ADC gain in uV */
static uint16_t adcGain_uV = 0;

/** I2C address of the device. */
static uint8_t i2c_address;

/** ADC offset in mV */
static int8_t adcOffset_mV = 0;

/** present charging status as determined by the coulomb counter sign */
static bool isCharging = false;

/** we currently have cell ballencing enabled */
static bool isBalancing = false;

/** schedule a rebasing operation */
static bool rebase = false;

/** lockout rebasing operations */
static bool rebaseLockout = false;

void (*sleepResetTimeout)(void);

/** This is essentially the number of points in the batteryCharge table + 1
 */
#define PERCENT_CHARGE_TABLE_FACTOR (BATTERY_MAH_CAPACITY_USER / \
    ((sizeof(BQ769X0_batteryChargeUser) / \
    sizeof(BQ769X0_batteryChargeUser[0])) - 1))

static uint8_t BQ769X0_registerRead(BQ769X0_Register reg);
static uint16_t BQ769X0_registerReadWord(BQ769X0_WordRegister reg);
static void BQ769X0_registerWrite(BQ769X0_Register reg, uint8_t data);
#if 0
static void BQ769X0_registerWriteWord(BQ769X0_WordRegister reg, uint16_t data);
#endif
static void BQ769X0_rebase(bool only_on_full);
static void BQ769X0_cellBalanceTest(void);
static BQ769X0_CellBalance BQ769X0_cellBalanceIndexTranslate(int index);
static int64_t BQ769X0_getCoulombCount(void);

/** Initialize the BQ769x0 device.
 * @param device Device type that is being used
 */
void BQ769X0_init(BQ769X0_Device device, void (*sleep_reset_timeout)(void))
{
    sleepResetTimeout = sleep_reset_timeout;
    switch (device)
    {
        default:
            break;
        case BQ7692000:
        case BQ7693000:
        case BQ7694000:
            i2c_address = BQ769X000_I2C_ADDR;
            break;
        case BQ7692001:
        case BQ7693001:
        case BQ7694001:
            i2c_address = BQ769X001_I2C_ADDR;
            break;
        case BQ7694002:
        case BQ7692002:
        case BQ7693002:
            i2c_address = BQ769X002_I2C_ADDR;
            break;
        case BQ7692003:
        case BQ7693003:
        case BQ7694003:
            i2c_address = BQ769X003_I2C_ADDR;
            break;
        case BQ7692006:
        case BQ7693006:
        case BQ7694006:
            i2c_address = BQ769X006_I2C_ADDR;
            break;
    }

    BQ769X0_wakeup();

    GPIO_INTERRUPT_HIGH_TO_LOW(BQ_FAULT_INT);
    GPIO_INTERRUPT_ENABLE(BQ_FAULT_INT);

    //GPIO_INTERRUPT_HIGH_TO_LOW(BQ_ALERT_INT);
    //GPIO_INTERRUPT_ENABLE(BQ_ALERT_INT);

}

/** Wakeup the BQ769x0 and reinitialize its volatile state.
 */
void BQ769X0_wakeup(void)
{
    gpio_enable_voltage_and_temp();
    BQ769X0_enable();

    BQ769X0_AdcGain1 adcgain1;
    BQ769X0_AdcGain2 adcgain2;

    adcgain1.byte = BQ769X0_registerRead(BQ_ADCGAIN1);
    adcgain2.byte = BQ769X0_registerRead(BQ_ADCGAIN2);

    adcGain_uV = 365 + (adcgain1.adcgain3_4 << 3) + adcgain2.adcgain0_1_2;

    adcOffset_mV = BQ769X0_registerRead(BQ_ADCOFFSET);

    /** @todo not the correct place to do, it should be as soon as we wakeup */
    uint16_t battery_voltage = ADC_convert(MSP430_ADC_BATTERY_VOLTAGE_USER);
    gpio_disable_voltage_and_temp();

    /** @todo only rebase if we have been idle for five hours or more, use ACLK.
     * We also need to defer this to the BQ769X0_service() method
     */
    rebase = true;

    /* update volatile protection registers */
    BQ769X0_registerWrite(BQ_PROTECT1, BQ769X0_PROTECT1_USER);
    BQ769X0_registerWrite(BQ_PROTECT2, BQ769X0_PROTECT2_USER);
    BQ769X0_registerWrite(BQ_PROTECT3, BQ769X0_PROTECT3_USER);
    BQ769X0_registerWrite(BQ_OV_TRIP, BQ769X0_OV_TRIP_USER);
    BQ769X0_registerWrite(BQ_UV_TRIP, BQ769X0_UV_TRIP_USER);

    /* The CC_CFG register, per the datasheet, should always be 0x19 */
    BQ769X0_registerWrite(BQ_CC_CFG, 0x19);

    /* - Enable ADC
     * - Temperature reading uses external thermister
     */
    BQ769X0_registerWrite(BQ_SYS_CTRL1, 0x18);

    /** @todo (Stuart Baker) may want to remove continuous coulomb counter */
    /* - Normal delay settings
     * - continuous coulomb counter
     * - discharge signal on
     * - charge signal off
     */
    BQ769X0_registerWrite(BQ_SYS_CTRL2, 0x42);

    /* clear any faults */
    BQ769X0_registerWrite(BQ_SYS_STAT, 0xFF);
}

/** Service any pending BQ769x0 tasks.
 */
void BQ769X0_service(void)
{
    static unsigned int count = 0;
    static bool is_charging_last = false;
    BQ769X0_SysStat status;
    status.byte = BQ769X0_registerRead(BQ_SYS_STAT);

    if (!status.ccReady)
    {
        /* ~250 msec timer has not expired */
        return;
    }

    if (rebase)
    {
        /* make sure that we did not lock out our rebasing.  The rebase lockout
         * is cleared when we start charging next.
         */
        if (!rebaseLockout)
        {
            BQ769X0_rebase(false);
        }
        rebase = false;
    }

    nAH += BQ769X0_getCoulombCount();

