bakerstu/msp430-libs/bq769x0/bq769x0.c
    /* make sure we truncate at 100% charged */
    if (nAH > (BATTERY_MAH_CAPACITY_USER * 1000LL * 1000LL))
    {
        nAH = BATTERY_MAH_CAPACITY_USER * 1000LL * 1000LL;
    }
    else if (nAH < 0)
    {
        nAH = 0;
        rebaseLockout = true;
    }

    BQ769X0_SysStat clear;
    clear.ccReady = 1;
    BQ769X0_registerWrite(BQ_SYS_STAT, clear.byte);

    /* we only only test for cell balancing periodically to save processing
     * time.
     *
     * If we are not charging, we will also see if we need to turn of balancing
     * just in case
     */
    if (count++ >= (BQ769X0_CELL_BALANCE_TEST_PERIOD_USER * 4) || !isCharging)
    {
        BQ769X0_cellBalanceTest();
        count = 0;
    }

    /* test if our charging state has changed from charging to not charging */
    if (!isCharging && is_charging_last)
    {
        /* we stopped charging, rebase if the pack is full */
        BQ769X0_rebase(true);
    }
    is_charging_last = isCharging;
}

/** Enable and/or wakeup the BQ769x0.
 */
void BQ769X0_enable(void)
{
    GPIO_DIRECTION_OUTPUT(BQ_WAKEUP);
    Timer_spinDelay(11);
    GPIO_DIRECTION_INPUT(BQ_WAKEUP);
    Timer_spinDelay(2);
}

/** Start coulomb counting.
 */
void BQ769X0_coulombCountStart(void)
{
    BQ769X0_SysCtrl2 sys_ctrl2;
    sys_ctrl2.byte = BQ769X0_registerRead(BQ_SYS_CTRL2);

    sys_ctrl2.ccEnable = 1;

    BQ769X0_registerWrite(BQ_SYS_CTRL2, sys_ctrl2.byte);
}

/** Stop coulomb counting.
 */
void BQ769X0_coulombCountStop(void)
{
    BQ769X0_SysCtrl2 sys_ctrl2;
    sys_ctrl2.byte = BQ769X0_registerRead(BQ_SYS_CTRL2);

    sys_ctrl2.ccEnable = 0;

    BQ769X0_registerWrite(BQ_SYS_CTRL2, sys_ctrl2.byte);
}

/** Enter "SHIP" mode, aka: put the device to sleep.
 */
void BQ769X0_enterShipMode(void)
{
    BQ769X0_SysCtrl1 sys_ctrl1;
    sys_ctrl1.byte = BQ769X0_registerRead(BQ_SYS_CTRL1);

    /* special sequence required to go into shutdown */
    sys_ctrl1.shutAB = 0x0;
    BQ769X0_registerWrite(BQ_SYS_CTRL1, sys_ctrl1.byte);
    sys_ctrl1.shutAB = 0x1;
    BQ769X0_registerWrite(BQ_SYS_CTRL1, sys_ctrl1.byte);
    sys_ctrl1.shutAB = 0x2;
    BQ769X0_registerWrite(BQ_SYS_CTRL1, sys_ctrl1.byte);
}

/** Turn on/off the charge signal.
 * @param active true to turn on, false to turn off
 */
void BQ769X0_chargeSignal(bool active)
{
    BQ769X0_SysCtrl2 sys_ctrl2;
    sys_ctrl2.byte = BQ769X0_registerRead(BQ_SYS_CTRL2);

    sys_ctrl2.chgOn = active ? 1 : 0;

    BQ769X0_registerWrite(BQ_SYS_CTRL2, sys_ctrl2.byte);
}

/** Turn on/off the discharge signal.
 * @param active true to turn on, false to turn off
 */
void BQ769X0_dischargeSignal(bool active)
{
    BQ769X0_SysCtrl2 sys_ctrl2;
    sys_ctrl2.byte = BQ769X0_registerRead(BQ_SYS_CTRL2);

    sys_ctrl2.dsgOn = active ? 1 : 0;

    BQ769X0_registerWrite(BQ_SYS_CTRL2, sys_ctrl2.byte);
}

/** Turn on cell balancing for one particular cell.  Caution, cell balancing
 * should only be used on one cell at a time.
 */
void BQ769X0_cellBalanceOn(BQ769X0_CellBalance cell)
{
    BQ769X0_registerWrite(BQ_CELLBAL1, cell);
}

/** Get the current charge percentage.
 * @return charge percentage (0-100%)
 */
uint8_t BQ769X0_chargePercent(void)
{
    int64_t percent;
    percent = nAH / (BATTERY_MAH_CAPACITY_USER * 1000LL * 1000LL / 100LL);

    if (percent < 0)
    {
        percent = 0;
    }
    else if (percent > 100)
    {
        percent = 100;
    }
    return percent;
}

/** Determine if the battery is charging (positive coulumn count).
 * @return true if charging, else false
 */
bool BQ769X0_isCharging(void)
{
    return isCharging;
}

/** Get a precision battery voltage measurement and rebase the coulomb counter.
 * @param only_on_full only rebase if pack voltage is above
 */
static void BQ769X0_rebase(bool only_on_full)
{
    uint16_t i;
    uint16_t battery_voltage = BQ769X0_registerReadWord(BQ_BAT);

    if (only_on_full)
    {
        if (battery_voltage < (BQ769X0_MV_CELL_FULL_CHARGE_USER * BQ769X0_CELL_COUNT))
        {
            /* battery not full, don't rebase */
            return;
        }
    }
    for (i = 0; i < (sizeof(BQ769X0_batteryChargeUser)/sizeof(BQ769X0_batteryChargeUser[0]) - 1); ++i)
    {
        if (battery_voltage <= BQ769X0_batteryChargeUser[i])
        {
            break;
        }
    }

    nAH = i * PERCENT_CHARGE_TABLE_FACTOR;
    nAH *= 1000LL * 1000LL;
}

/** Determine if cell balancing is reqiured, and update cell balancing state
 * if necessary.
 */
static void BQ769X0_cellBalanceTest(void)
{
    if (!isCharging)
    {
        if (isBalancing)
        {
            BQ769X0_cellBalanceOn(
                BQ769X0_cellBalanceIndexTranslate(BQ_CELL_NONE_BALANCE));
            isBalancing = false;
        }
        return;
    }

    /* check for cell balancing */
    uint16_t cell_voltage[BQ769X0_CELL_COUNT];
    for (int i = 0, j = 0; i < BQ769X0_CELL_COUNT; ++i, ++j)
    {
#if BQ769X0_CELL_COUNT == 3
        if (i == 2)
        {
            /* skip VC3-VC2 and VC4-VC3 */
            j += 2;
        }
#elif BQ769X0_CELL_COUNT == 4
        if (i == 3)
        {
            /* skip VC4-VC3 */
            ++j;
        }
#elif BQ769X0_CELL_COUNT == 6
        if (i == 2 || i == 5)
        {
            /* skip VC3-VC2 and VC4-VC3 */
            j += 2;
        }
#elif BQ769X0_CELL_COUNT == 7
        if (i == 3)
        {
            /* skip VC3-VC2 and VC4-VC3 */
            ++j;
        }
        if (i == 6)
        {
            /* skip VC3-VC2 and VC4-VC3 */
            j += 2;
        }
#elif BQ769X0_CELL_COUNT == 8
        if (i == 3 || i == 7)
        {
            /* skip VC3-VC2 and VC4-VC3 */
            ++j;
        }
#elif BQ769X0_CELL_COUNT == 9
        if (i == 8)
        {
            /* skip VC3-VC2 and VC4-VC3 */
            ++j;
        }
#endif
        /** @todo add support for up to 15 cells */

        /* read cell voltage */
        int read_index = BQ_VC1 + (j * 2);
        cell_voltage[i] =
            BQ769X0_registerReadWord((BQ769X0_WordRegister)read_index);
    }
    static int old_highest = 0;
    int highest = 0;
    int lowest = 0;

    /* find the highest and lowest cell indexes */
    for (int i = 1; i < BQ769X0_CELL_COUNT; ++i)
    {
        if (cell_voltage[i] > cell_voltage[highest])
        {
            highest = i;
        }
        if (cell_voltage[i] < cell_voltage[lowest])
        {
            lowest = i;
        }
    }

    int balance_index;
    if (cell_voltage[highest] < BQ769X0_MV_CELL_BALANCE_MIN_USER)
    {
        if (!isBalancing)
        {
            /* not above minimum voltage to start ballancing, bail */
            return;
        }

        /* should never get to this point, but just in case, turn
         * off cell ballancing
         */
        balance_index = -1;
    }
    else if ((cell_voltage[highest] - cell_voltage[lowest]) <=
        BQ769X0_MV_CELL_BALANCE_STOP_USER && isBalancing)
    {
        /* we are balancing and we have crossed our stop balancing
         * threashold
         */
        balance_index = -1;
    }
    else if ((isBalancing && highest != old_highest) ||
             ((cell_voltage[highest] - cell_voltage[lowest]) >=
              BQ769X0_MV_CELL_BALANCE_START_USER && !isBalancing))
    {
        /* we are balancing, but have a new highest voltage cell
         *
         * ...or...
         *
         * we are not balancing and we have crossed our start balancing
         * threashold
         */
        balance_index = old_highest = highest;
    }
    else
    {
        return;
    }

    /* update balancing state */
    BQ769X0_cellBalanceOn(BQ769X0_cellBalanceIndexTranslate(balance_index));
    isBalancing = balance_index == BQ_CELL_NONE_BALANCE ? false : true;
}

/** Get the last coulomb count.
 * @return coulomb count change in nAH
 */
static int64_t BQ769X0_getCoulombCount(void)
{
    BQ769X0_CC cc;

