bakerstu/msp430-libs/bq769x0/bq769x0.c
    /* coulomb data ready, update coulomb count */
    cc.word = BQ769X0_registerReadWord(BQ_CC);

    /* filter out some noise */
    if (cc.cc > 2 || cc.cc < -2)
    {
        sleepResetTimeout();

        /* setup or charging status flag */
        if (cc.cc > 2)
        {
            isCharging = true;
            rebaseLockout = false;
        }
        else
        {
            isCharging = false;
        }

        /* Translate to mA, multiply by 1000.
         * Sampled every 250 msec, divide by 4 to normalize to 1 second.
         * Divide by amps/tick to normalize to the sense resistance
         * Nomralize to hours, divide by 3600.
         */
       return (cc.cc * 1000LL * 1000LL * 1000LL) /
               BQ769X0_CC_PER_AMP_USER / 4 / 3600;
    }

    isCharging = false;
    return 0;
}

/** Translate from the logical configuration index (3 - 15 cells) to the index
 * index and ultimate enumaration used by @ref BQ769X0_CellBalance.
 * @param index logical configuration index
 * @return @ref BQ769X0_CellBalance enumeration coresponding to index
 */
static BQ769X0_CellBalance BQ769X0_cellBalanceIndexTranslate(int index)
{
    int actual_index = index;
#if BQ769X0_CELL_COUNT == 3
                if (index == 2)
                {
                    /* skip VC3-VC2 and VC4-VC3 */
                    actual_index += 2;
                }
#elif BQ769X0_CELL_COUNT == 4
                if (index == 3)
                {
                    /* skip VC4-VC3 */
                    ++actual_index;
                }
#elif BQ769X0_CELL_COUNT == 6
                if (index == 2 || index == 5)
                {
                    /* skip VC3-VC2 and VC4-VC3 */
                    actual_index += 2;
                }
#elif BQ769X0_CELL_COUNT == 7
                if (index == 3)
                {
                    /* skip VC3-VC2 and VC4-VC3 */
                    ++actual_index;
                }
                if (index == 6)
                {
                    /* skip VC3-VC2 and VC4-VC3 */
                    actual_index += 2;
                }
#elif BQ769X0_CELL_COUNT == 8
                if (index == 3 || index == 7)
                {
                    /* skip VC3-VC2 and VC4-VC3 */
                    ++actual_index;
                }
#elif BQ769X0_CELL_COUNT == 9
                if (index == 8)
                {
                    /* skip VC3-VC2 and VC4-VC3 */
                    ++actual_index;
                }
#endif
    switch (actual_index)
    {
        default:
            return BQ_CELL_NONE_BALANCE;
        case 0:
            return BQ_CELL_1_BALANCE;
        case 1:
            return BQ_CELL_2_BALANCE;
        case 2:
            return BQ_CELL_3_BALANCE;
        case 3:
            return BQ_CELL_4_BALANCE;
        case 4:
            return BQ_CELL_5_BALANCE;
    }
}

/** Read a register value on the Bq769x0 device.
 * @param reg register to read
 * @return value read
 */
static uint8_t BQ769X0_registerRead(BQ769X0_Register reg)
{
    uint8_t wr_data[1] = {reg};
    uint8_t rd_data[1];

    I2C_sendReceive(BQ769X0_I2C_MODULE, i2c_address, wr_data, 1, rd_data, 1);

    return rd_data[0];
}

/** Read a word (2 byte) register value on the Bq769x0 device.
 * @param reg register to read
 * @return value read
 */
static uint16_t BQ769X0_registerReadWord(BQ769X0_WordRegister reg)
{
    uint8_t wr_data[1] = {reg};
    uint8_t rd_data[2];

    I2C_sendReceive(BQ769X0_I2C_MODULE, i2c_address, wr_data, 1, rd_data, 2);

    return ((uint16_t)rd_data[0] << 8) + (uint16_t)rd_data[1];
}

/** Write a register value on the Bq769x0 device.
 * @param reg register to write
 * @param data data to write
 */
static void BQ769X0_registerWrite(BQ769X0_Register reg, uint8_t data)
{
    uint8_t wr_data[2] = {reg, data};

    I2C_send(BQ769X0_I2C_MODULE, i2c_address, wr_data, 2);
}

#if 0
/** Write a word (2 byte) register value on the Bq769x0 device.
 * @param reg register to write
 * @param data data to write
 */
static void BQ769X0_registerWriteWord(BQ769X0_WordRegister reg, uint16_t data)
{
    uint8_t wr_data[3] = {reg, data >> 8, data & 0xFF};

    I2C_send(BQ769X0_I2C_MODULE, i2c_address, wr_data, 3);
}
#endif
